{
  "hero.subtitle": "Developer | Script author | Open Source enthusiast",
  "hero.greeting": "Hi, I'm",
  "btn.projects": "My projects",
  "btn.contact": "Contact",
  "nav.home": "Home",
  "nav.about": "About",
  "nav.projects": "Projects",
  "nav.skills": "Skills",
  "nav.contact": "Contact",
  "about.p1": "I'm a passionate developer specializing in user scripts, web apps and bots. I work with JavaScript, Python and modern web technologies.",
  "about.p2": "I enjoy solving hard problems and creating tools that make users' lives easier. I contribute to open-source projects and share my work with the community.",
  "stat.projects": "Projects",
  "stat.0": "Projects",
  "stat.1": "Lines of code",
  "stat.2": "Users",
  "project.yt.sub": "User script to enhance YouTube: extra player settings, hotkeys and improved UI.",
  "project.yt.link": "View",
  "project.telegram.sub": "User script to extend Telegram Web: extra features, privacy improvements and UI tweaks.",
  "project.telegram.link": "View",
  "project.ytdl.sub": "Web app for downloading YouTube videos with quality selection, playlist support and fast conversion.",
  "project.myport.sub": "Multi-purpose Telegram bot with async architecture for automation and user interaction.",
  "project.myport.link": "Try",
  "skills.javascript.desc": "Experience with modern ES6+, DOM manipulation, async programming (Promise, async/await) and building interactive web apps and user scripts.",
  "skills.python.desc": "Server-side development with Flask, Telegram bots, automation and data processing. Experience with asyncio for async development.",
  "skills.htmlcss.desc": "Semantic markup, responsive design, modern CSS3 (Flexbox, Grid, animations). Building beautiful accessible interfaces.",
  "skills.typescript.desc": "Typed JavaScript development, building scalable apps with better IDE support and fewer runtime errors.",
  "skills.react.desc": "Building modern single-page applications with React, state management, hooks and component-driven development.",
  "skills.git.desc": "Version control, branching, pull requests, code review and CI/CD integration. Experience collaborating in teams.",
  "skills.api.desc": "Working with REST APIs, integrating external services, developing and consuming APIs. Experience with Telegram Bot API and YouTube API.",
  "skills.nodejs.desc": "Server-side development with Node.js: building REST APIs, working with databases and the filesystem, and creating backend utilities.",
  "contact.text": "Interested in collaboration or have questions? I'm open to new opportunities and interesting projects!",
  "contact.method.greasyfork.desc": "My scripts"
}
