{
  "hero.subtitle": "Разработчик | Создатель скриптов | Open Source энтузиаст",
  "btn.projects": "Мои проекты",
  "btn.contact": "Связаться",
  "nav.home": "Главная",
  "nav.about": "О себе",
  "nav.projects": "Проекты",
  "nav.skills": "Навыки",
  "nav.contact": "Контакты",
  "about.p1": "Я увлеченный разработчик, специализирующийся на создании пользовательских скриптов, веб-приложений и ботов. Работаю с JavaScript, Python и современными веб-технологиями.",
  "about.p2": "Люблю решать сложные задачи и создавать полезные инструменты, которые упрощают жизнь пользователям. Вношу вклад в open-source проекты и делюсь своими наработками.",
  "stat.projects": "Проектов",
  "stat.0": "Проектов",
  "stat.1": "Строк кода",
  "stat.2": "Пользователей",
  "hero.greeting": "Привет, я",
  "project.yt.sub": "Пользовательский скрипт для улучшения YouTube: дополнительные настройки плеера, горячие клавиши и улучшенный интерфейс.",
  "project.yt.link": "Смотреть",
  "project.telegram.sub": "Скрипт для расширения возможностей Telegram Web: дополнительные функции, улучшенная приватность и кастомизация интерфейса.",
  "project.telegram.link": "Смотреть",
  "project.ytdl.sub": "Веб-приложение для загрузки видео с YouTube с выбором качества, поддержкой плейлистов и быстрой конвертацией.",
  "project.myport.sub": "Многофункциональный Telegram бот с асинхронной архитектурой для автоматизации задач и взаимодействия с пользователями.",
  "project.myport.link": "Попробовать",
  "skills.javascript.desc": "Опыт работы с современным ES6+, DOM-манипуляциями, асинхронным программированием (Promise, async/await) и созданием интерактивных веб-приложений и пользовательских скриптов.",
  "skills.python.desc": "Разработка серверных приложений с Flask, создание Telegram ботов, автоматизация задач и обработка данных. Опыт работы с asyncio для асинхронной разработки.",
  "skills.htmlcss.desc": "Семантическая верстка, адаптивный дизайн, современные технологии CSS3 (Flexbox, Grid, анимации). Создание красивых и доступных интерфейсов.",
  "skills.typescript.desc": "Типизированная разработка на JavaScript, создание масштабируемых приложений с улучшенной поддержкой IDE и меньшим количеством ошибок.",
  "skills.react.desc": "Создание современных single-page приложений с использованием React, управление состоянием, hooks и компонентный подход к разработке.",
  "skills.git.desc": "Контроль версий, работа с ветками, pull requests, code review и CI/CD интеграция. Опыт совместной разработки в команде.",
  "skills.api.desc": "Работа с REST API, интеграция внешних сервисов, разработка и потребление API. Опыт работы с Telegram Bot API и YouTube API.",
  "skills.nodejs.desc": "Серверная разработка на Node.js: создание REST API, работа с базами данных и файловой системой, а также написание утилит для backend'а.",
  "contact.text": "Заинтересованы в сотрудничестве или есть вопросы? Я всегда открыт для новых возможностей и интересных проектов!",
  "contact.method.greasyfork.desc": "Мои скрипты"
}
